<a href="https://colab.research.google.com/github/afraniofilho/Python-Training-Ford/blob/main/Python_Training_aula_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
'Price': [22000, 25000, 27000, 35000],
'Quality' : [800, 750, 900, 900]
}

In [3]:
cars

{'Brand': ['Honda Civic', 'Toyota Corolla', 'Ford Focus', 'Audi A4'],
 'Price': [22000, 25000, 27000, 35000],
 'Quality': [800, 750, 900, 900]}

In [4]:
df = pd.DataFrame(cars, columns= ['Brand', 'Price', 'Quality'])

In [5]:
df

            Brand  Price  Quality
0     Honda Civic  22000      800
1  Toyota Corolla  25000      750
2      Ford Focus  27000      900
3         Audi A4  35000      900

In [42]:
df.loc[0, 'Brand'][1]

'o'

In [41]:
item

'o'

In [9]:
df.loc[0]

Brand      Honda Civic
Price            22000
Quality            800
Name: 0, dtype: object

In [14]:
df1 = df.loc[1:3]

In [15]:
df1

            Brand  Price  Quality
1  Toyota Corolla  25000      750
2      Ford Focus  27000      900
3         Audi A4  35000      900

In [48]:
df.loc[1:3, 'Brand']

1    Toyota Corolla
2        Ford Focus
3           Audi A4
Name: Brand, dtype: object

In [17]:
df.loc[1:3, ['Brand', 'Quality']]

            Brand  Quality
1  Toyota Corolla      750
2      Ford Focus      900
3         Audi A4      900

In [18]:
df.loc[df['Quality'] > 800]

        Brand  Price  Quality
2  Ford Focus  27000      900
3     Audi A4  35000      900

In [19]:
# Selecionar os registros onde Price > 30000 e o Quality > 800

In [21]:
df.loc[(df['Price'] > 30000) &  (df['Quality'] > 800)]

     Brand  Price  Quality
3  Audi A4  35000      900

In [22]:
# Selecionar os registros em que o "Brand" seja 'Ford Focus' ou 'Brand' seja 'Toyota Corolla'

In [23]:
df.loc[(df['Brand'] == 'Ford Focus') | (df['Brand'] == 'Toyota Corolla')]

            Brand  Price  Quality
1  Toyota Corolla  25000      750
2      Ford Focus  27000      900

In [51]:
x = df.loc[df.Brand == 'Ford Focus', 'Quality'][2]

In [52]:
type(x)

numpy.int64

In [34]:
x + 60

2    960
Name: Quality, dtype: int64

In [53]:
df

            Brand  Price  Quality
0     Honda Civic  22000      800
1  Toyota Corolla  25000      750
2      Ford Focus  27000      900
3         Audi A4  35000      900

In [55]:
df.iloc[2, 2]

900

In [56]:
df.iloc[3]

Brand      Audi A4
Price        35000
Quality        900
Name: 3, dtype: object

In [57]:
df.drop(1, inplace=True)

In [58]:
df

         Brand  Price  Quality
0  Honda Civic  22000      800
2   Ford Focus  27000      900
3      Audi A4  35000      900

In [60]:
df.iloc[1]

Brand      Ford Focus
Price           27000
Quality           900
Name: 2, dtype: object

In [63]:
df.reset_index(drop=True, inplace=True)

In [64]:
df

         Brand  Price  Quality
0  Honda Civic  22000      800
1   Ford Focus  27000      900
2      Audi A4  35000      900

In [66]:
df.iloc[1]

Brand      Ford Focus
Price           27000
Quality           900
Name: 1, dtype: object